backend/tests/load/load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: 'Warm up phase'
    - duration: 120
      arrivalRate: 20
      name: 'Sustained load phase'
    - duration: 60
      arrivalRate: 20
      rampTo: 40
      name: 'High load phase'
  processor: './test-functions.js'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

scenarios:
  - name: 'Login and check predictions (patient)'
    weight: 70
    flow:
      - function: 'generateRandomUser'
      - post:
          url: '/api/v1/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: '$.token'
              as: 'userToken'
      - get:
          url: '/api/v1/auth/me'
          headers:
            Authorization: 'Bearer {{ userToken }}'
      - think: 2
      - get:
          url: '/api/v1/predictions'
          headers:
            Authorization: 'Bearer {{ userToken }}'
      - think: 3
      - get:
          url: '/api/v1/appointments'
          headers:
            Authorization: 'Bearer {{ userToken }}'
            
  - name: 'Login and create prediction (doctor)'
    weight: 30
    flow:
      - function: 'generateDoctorUser'
      - post:
          url: '/api/v1/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: '$.token'
              as: 'doctorToken'
      - function: 'getRandomPatientId'
      - post:
          url: '/api/v1/predictions'
          headers:
            Authorization: 'Bearer {{ doctorToken }}'
          json:
            patient: '{{ patientId }}'
            cancerType: '{{ cancerType }}'
            data: '{{ predictionData }}'